''''
1. Написать функцию season, принимающую 1 аргумент — номер месяца (от 1 до 12), и возвращающую время
года, которому этот месяц принадлежит (зима, весна, лето или осень).
'''


def get_season(number):
    # write your code here
    pass


print(get_season(2))  # add more cases
"""
2. Реализовать функцию, которая принимает строку и расделитель и возвращает словарь {слово: количество повторений}
"""


def converter(string, separator):
    # write your code here
    pass


my_str = input('String')
delimiter = input('delimiter')

print(converter(my_str, delimiter))


'''
3. Написать функцию square, принимающую 1 аргумент — сторону квадрата, и возвращающую 3 значения: периметр квадрата, 
площадь квадрата и диагональ квадрата.
'''


def get_rectangle_data(a):
    # write your code here
    pass


"football, foot, summer, sum, ball, football"

delimiter = ', '

result = {'football': 2, 'foot': 1, 'summer': 1, 'sum': 1, 'ball': 1}
